#+title: ENG306 - Power Electronics - Converter Design Report
#+AUTHOR: Baley Eccles - 652137 and Tyler Robards - 651790
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage[a4paper, margin=2cm]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+LATEX_HEADER_EXTRA: \usepackage{fontspec}
#+LATEX_HEADER_EXTRA: \setmonofont{Iosevka}
#+LATEX_HEADER_EXTRA: \setminted{fontsize=\small, frame=single, breaklines=true}
#+LATEX_HEADER_EXTRA: \usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA: \usepackage{float}
#+LATEX_HEADER_EXTRA: \usepackage[final]{pdfpages}
#+LATEX_HEADER_EXTRA: \setlength{\parindent}{0pt}
#+LATEX_HEADER_EXTRA: \setlength{\parskip}{1em}
#+LATEX_HEADER: \usepackage[style=apa, backend=biber]{biblatex}
#+LATEX_HEADER: \addbibresource{References.bib}
#+LATEX_HEADER: \DeclareLanguageMapping{english}{english-apa}

\newpage
* Appendix A - R16 And Rb16 Code

#+BEGIN_SRC octave :exports both :results output :session R16_Rb16 :eval no
clc;
clear;
close all;

if exist('OCTAVE_VERSION', 'builtin')
 set(0, "DefaultLineLineWidth", 2);
 set(0, "DefaultAxesFontSize", 25);
 warning('off');
end

R_18 = 22.4;
R_17 = 4.345e3;
R_FB1 = 338.7;
V_out = 12;

R_FB2 = R_17 + R_18;
R_FB1 = R_FB2/(V_out/0.8 - 1);

% Avalible resistors
R_vals = [1e3, 10e3, 1, 1.2, 1.5, 2, 2.7, 3.3, 4.3, 5.1, 6.8, 8.2, 10, 12, 15, 20, 27, 33, 43, 51, 68, 82, 100, 120, 150, 200, 270, 330, 430, 510, 680, 820, 1.2e3, 1.5e3, 2e3, 2.7e3, 3.3e3, 4.3e3, 5.1e3, 6.8e3, 8.2e3, 12e3, 15e3, 20e3, 27e3, 33e3, 43e3, 51e3, 68e3, 82e3, 100e3, 120e3, 150e3, 200e3, 270e3, 330e3, 430e3, 510e3, 680e3, 820e3, 1e6, 2e6];
R16 = R_vals;
Rb16 = 1./(1./R_FB1 - 1./R16);

tol = 2.5/100; % Tolerance of 2.5%
for idx = 1:length(R16)
  for jdx = 1:length(R_vals)
    up_bound = R_vals(jdx) + R_vals(jdx)*tol;
    low_bound = R_vals(jdx) - R_vals(jdx)*tol;
    if (Rb16(idx) >= low_bound && Rb16(idx) <= up_bound)
      percent_error = 100*abs(R_vals(jdx) - Rb16(idx))/Rb16(idx);
      V_out_true = 0.8*(R_FB2/(1/(1/R16(idx) + 1/R_vals(jdx))) + 1);
      
      sprintf("For a resistor error of %f%% choose:", percent_error)
      sprintf("R16 = %.0f and ideally Rb16 = %.3f, but select Rb16 = %.0f from the book.\nThis will give an output voltage of %.3f and 12 - Vo = %.4f", R16(idx), Rb16(idx), R_vals(jdx), V_out_true, 12 - V_out_true)
      sprintf("\n")
      
    end
  end
end
#+END_SRC

#+RESULTS:
#+begin_example
ans = For a resistor error of 2.483762% choose:
ans = R16 = 10000 and ideally Rb16 = 322.002, but select Rb16 = 330 from the book.
This will give an output voltage of 11.737 and 12 - Vo = 0.2630
ans = 

ans = For a resistor error of 2.072306% choose:
ans = R16 = 510 and ideally Rb16 = 803.352, but select Rb16 = 820 from the book.
This will give an output voltage of 11.912 and 12 - Vo = 0.0883
ans = 

ans = For a resistor error of 1.288873% choose:
ans = R16 = 820 and ideally Rb16 = 503.510, but select Rb16 = 510 from the book.
This will give an output voltage of 11.912 and 12 - Vo = 0.0883
ans = 

ans = For a resistor error of 2.006113% choose:
ans = R16 = 1200 and ideally Rb16 = 421.543, but select Rb16 = 430 from the book.
This will give an output voltage of 11.837 and 12 - Vo = 0.1630
ans = 

ans = For a resistor error of 1.890657% choose:
ans = R16 = 4300 and ideally Rb16 = 336.359, but select Rb16 = 330 from the book.
This will give an output voltage of 12.200 and 12 - Vo = -0.2002
ans = 

ans = For a resistor error of 0.686827% choose:
ans = R16 = 5100 and ideally Rb16 = 332.282, but select Rb16 = 330 from the book.
This will give an output voltage of 12.073 and 12 - Vo = -0.0727
ans = 

ans = For a resistor error of 0.930820% choose:
ans = R16 = 6800 and ideally Rb16 = 326.957, but select Rb16 = 330 from the book.
This will give an output voltage of 11.901 and 12 - Vo = 0.0986
ans = 

ans = For a resistor error of 1.759371% choose:
ans = R16 = 8200 and ideally Rb16 = 324.294, but select Rb16 = 330 from the book.
This will give an output voltage of 11.814 and 12 - Vo = 0.1863
ans =
#+end_example

\newpage
* Appendix C - Testing Code

#+BEGIN_SRC octave :exports both :results output :session TESTING :eval no
clc
clear
close all

if exist('OCTAVE_VERSION', 'builtin')
 set(0, "DefaultLineLineWidth", 2);
 set(0, "DefaultAxesFontSize", 25);
 warning('off');
end

function [V_ripple, V_ripple_percent, V_min, V_max, V_mean] = voltage_data(t, V)
  Q1 = prctile(V, 25);
  Q3 = prctile(V, 75);
  IQR = Q3 - Q1;
  lower_bound = Q1 - 2 * IQR;
  upper_bound = Q3 + 2 * IQR;
  indices = (V >= lower_bound & V <= upper_bound);
  t = t(indices);
  V = V(indices);

  V_max = max(V);
  V_min = min(V);
  V_ripple = V_max - V_min;
  V_mean = mean(V);
  V_ripple_percent = V_ripple/V_mean*100;
end

data_NL = dlmread('./Data/32RMS_Voltage_output_No_Load.CSV', ',', 1, 0);

t_NL = data_NL(:, 1);
t_NL = t_NL - t_NL(1);
V_NL = data_NL(:, 2);
figure;
plot(t_NL(1:1e4), V_NL(1:1e4));
title("No Load V_{\textrm{in}} = 32 VRMS")
print -dpng 'ENG306_Design_No_Load_V_in_32_VRMS.png'

[NL_V_ripple, NL_V_ripple_percent, NL_V_min, NL_V_max, NL_V_mean] = voltage_data(t_NL, V_NL);
sprintf("NL_V_ripple = %fmV\n", NL_V_ripple*1e3)
sprintf("NL_V_ripple_percent = %f%%\n", NL_V_ripple_percent)
sprintf("NL_V_min = %fV\n", NL_V_min)
sprintf("NL_V_max = %fV\n", NL_V_max)
sprintf("NL_V_mean = %fV\n", NL_V_mean)
sprintf("\n")

data_22_Ohm = dlmread('./Data/32RMS_Voltage_output_22_Ohm.CSV', ',', 1, 0);

t_22_Ohm = data_22_Ohm(:, 1);
t_22_Ohm = t_22_Ohm - t_22_Ohm(1);
V_22_Ohm = data_22_Ohm(:, 2);
figure;
plot(t_22_Ohm(1:1e4), V_22_Ohm(1:1e4));
title("22 Ohm Load V_{\textrm{in}} = 32 VRMS")
print -dpng 'ENG306_Design_22_Ohm_Load_V_in_32_VRMS.png'

[V_ripple_22_Ohm, V_ripple_percent_22_Ohm, V_min_22_Ohm, V_max_22_Ohm, V_mean_22_Ohm] = voltage_data(t_22_Ohm, V_22_Ohm);
sprintf("V_ripple_22_Ohm = %fmV\n", V_ripple_22_Ohm*1e3)
sprintf("V_ripple_percent_22_Ohm = %f%%\n", V_ripple_percent_22_Ohm)
sprintf("V_min_22_Ohm = %fV\n", V_min_22_Ohm)
sprintf("V_max_22_Ohm = %fV\n", V_max_22_Ohm)
sprintf("V_mean_22_Ohm = %fV\n", V_mean_22_Ohm)
sprintf("\n")

data_2_5_Ohm = dlmread('./Data/32RMS_Voltage_output_2.5_Ohm.CSV', ',', 1, 0);

t_2_5_Ohm = data_2_5_Ohm(:, 1);
t_2_5_Ohm = t_2_5_Ohm - t_2_5_Ohm(1);
V_2_5_Ohm = data_2_5_Ohm(:, 2);
figure;
plot(t_2_5_Ohm(1:1e4), V_2_5_Ohm(1:1e4));
title("2.5 Ohm Load V_{\textrm{in}} = 32 VRMS")
print -dpng 'ENG306_Design_2.5_Ohm_Load_V_in_32_VRMS.png'

[V_ripple_2_5_Ohm, V_ripple_percent_2_5_Ohm, V_min_2_5_Ohm, V_max_2_5_Ohm, V_mean_2_5_Ohm] = voltage_data(t_2_5_Ohm, V_2_5_Ohm);
sprintf("V_ripple_2_5_Ohm = %fmV\n", V_ripple_2_5_Ohm*1e3)
sprintf("V_ripple_percent_2_5_Ohm = %f%%\n", V_ripple_percent_2_5_Ohm)
sprintf("V_min_2_5_Ohm = %fV\n", V_min_2_5_Ohm)
sprintf("V_max_2_5_Ohm = %fV\n", V_max_2_5_Ohm)
sprintf("V_mean_2_5_Ohm = %fV\n", V_mean_2_5_Ohm)
sprintf("\n")

data_23_RMS_25_Ohm = dlmread('./Data/23RMS_Voltage_output_25_Ohm.CSV', ',', 1, 0);

t_23_RMS_25_Ohm = data_23_RMS_25_Ohm(:, 1);
t_23_RMS_25_Ohm = t_23_RMS_25_Ohm - t_23_RMS_25_Ohm(1);
V_23_RMS_25_Ohm = data_23_RMS_25_Ohm(:, 2);
figure;
plot(t_23_RMS_25_Ohm(1:1e4), V_23_RMS_25_Ohm(1:1e4));
title("25 Ohm Load V_{\textrm{in}} = 23 VRMS")
print -dpng 'ENG306_Design_25_Ohm_Load_V_in_23_VRMS.png'

[V_ripple_23_RMS_25_Ohm, V_ripple_percent_23_RMS_25_Ohm, V_min_23_RMS_25_Ohm, V_max_23_RMS_25_Ohm, V_mean_23_RMS_25_Ohm] = voltage_data(t_23_RMS_25_Ohm, V_23_RMS_25_Ohm);
sprintf("V_ripple_23_RMS_25_Ohm = %fmV\n", V_ripple_23_RMS_25_Ohm*1e3)
sprintf("V_ripple_percent_23_RMS_25_Ohm = %f%%\n", V_ripple_percent_23_RMS_25_Ohm)
sprintf("V_min_23_RMS_25_Ohm = %fV\n", V_min_23_RMS_25_Ohm)
sprintf("V_max_23_RMS_25_Ohm = %fV\n", V_max_23_RMS_25_Ohm)
sprintf("V_mean_23_RMS_25_Ohm = %fV\n", V_mean_23_RMS_25_Ohm)
sprintf("\n")

data_20_RMS_2_5_Ohm = dlmread('./Data/20RMS_Voltage_output_2.5_Ohm.CSV', ',', 1, 0);

t_20_RMS_2_5_Ohm = data_20_RMS_2_5_Ohm(:, 1);
t_20_RMS_2_5_Ohm = t_20_RMS_2_5_Ohm - t_20_RMS_2_5_Ohm(1);
V_20_RMS_2_5_Ohm = data_20_RMS_2_5_Ohm(:, 2);
figure;
plot(t_20_RMS_2_5_Ohm(1:130256), V_20_RMS_2_5_Ohm(1:130256));
title("2.5 Ohm Load V_{\textrm{in}} = 20 VRMS")
print -dpng 'ENG306_Design_2.5_Ohm_Load_V_in_20_VRMS.png'

[V_ripple_20_RMS_2_5_Ohm, V_ripple_percent_20_RMS_2_5_Ohm, V_min_20_RMS_2_5_Ohm, V_max_20_RMS_2_5_Ohm, V_mean_20_RMS_2_5_Ohm] = voltage_data(t_20_RMS_2_5_Ohm, V_20_RMS_2_5_Ohm);
sprintf("V_ripple_20_RMS_2_5_Ohm = %fmV\n", V_ripple_20_RMS_2_5_Ohm*1e3)
sprintf("V_ripple_percent_20_RMS_2_5_Ohm = %f%%\n", V_ripple_percent_20_RMS_2_5_Ohm)
sprintf("V_min_20_RMS_2_5_Ohm = %fV\n", V_min_20_RMS_2_5_Ohm)
sprintf("V_max_20_RMS_2_5_Ohm = %fV\n", V_max_20_RMS_2_5_Ohm)
sprintf("V_mean_20_RMS_2_5_Ohm = %fV\n", V_mean_20_RMS_2_5_Ohm)
#+END_SRC

#+RESULTS:
#+begin_example
ans = NL_V_ripple = 25.390000mV
ans = NL_V_ripple_percent = 0.212747%
ans = NL_V_min = 11.921480V
ans = NL_V_max = 11.946870V
ans = NL_V_mean = 11.934354V
ans =
ans = V_ripple_22_Ohm = 35.150000mV
ans = V_ripple_percent_22_Ohm = 0.295837%
ans = V_min_22_Ohm = 11.864840V
ans = V_max_22_Ohm = 11.899990V
ans = V_mean_22_Ohm = 11.881539V
ans =
ans = V_ripple_2_5_Ohm = 293.000000mV
ans = V_ripple_percent_2_5_Ohm = 2.484134%
ans = V_min_2_5_Ohm = 11.648800V
ans = V_max_2_5_Ohm = 11.941800V
ans = V_mean_2_5_Ohm = 11.794855V
ans =
ans = V_ripple_23_RMS_25_Ohm = 41.020000mV
ans = V_ripple_percent_23_RMS_25_Ohm = 0.344099%
ans = V_min_23_RMS_25_Ohm = 11.899990V
ans = V_max_23_RMS_25_Ohm = 11.941010V
ans = V_mean_23_RMS_25_Ohm = 11.920997V
ans =
ans = V_ripple_20_RMS_2_5_Ohm = 10644.500000mV
ans = V_ripple_percent_20_RMS_2_5_Ohm = 116.908520%
ans = V_min_20_RMS_2_5_Ohm = 1.258200V
ans = V_max_20_RMS_2_5_Ohm = 11.902700V
ans = V_mean_20_RMS_2_5_Ohm = 9.104982V
#+end_example

\newpage
